**The Structure of Data**

Broman and Woo, "Data Organization in Spreadsheets" (2017)
* Make a single big rectangle: rows for subjects and columns for variables
* Create a data dictionary
* Leave no empty cells

* **Use Consistent:**
* Case Identifiers
* Variable names
* Codes for categorical variables
* Codes for missing values
* Format for all dates
* Data layout in multiple files
* File Names

In [2]:
# Standard imports

import numpy as np
import pandas as pd
import matplotlib
import matplotlib.pyplot as plt

In [7]:
tb = pd.read_csv('./Exercise Files/chapter2/02_05/tb.csv')

In [9]:
tb.columns

Index(['country', 'year', 'm04', 'm514', 'm014', 'm1524', 'm2534', 'm3544',
       'm4554', 'm5564', 'm65', 'mu', 'f04', 'f514', 'f014', 'f1524', 'f2534',
       'f3544', 'f4554', 'f5564', 'f65', 'fu'],
      dtype='object')

In [10]:
tbmelt = tb.melt(['country','year'],['m04', 'm514', 'm014', 'm1524', 'm2534', 'm3544',
       'm4554', 'm5564', 'm65', 'mu', 'f04', 'f514', 'f014', 'f1524', 'f2534',
       'f3544', 'f4554', 'f5564', 'f65', 'fu'], 'sexage','cases')

In [11]:
tbmelt.head()

  country  year sexage  cases
0      AD  1989    m04    NaN
1      AD  1990    m04    NaN
2      AD  1991    m04    NaN
3      AD  1992    m04    NaN
4      AD  1993    m04    NaN

In [13]:
tbmelt['sex'] = tbmelt['sexage'].str.slice(0,1)
tbmelt['age'] = tbmelt['sexage'].str.slice(1)

In [14]:
tbmelt.head()

  country  year sexage  cases sex age
0      AD  1989    m04    NaN   m  04
1      AD  1990    m04    NaN   m  04
2      AD  1991    m04    NaN   m  04
3      AD  1992    m04    NaN   m  04
4      AD  1993    m04    NaN   m  04

In [19]:
tbmelt['age'] = tbmelt['age'].map({'04':'0-4', '514':'5-14', '1524':'15-24','2534':'25-34','3544':'35-44',
                            '4554':'45-54','5564':'55-64','65':'65+','u':np.nan})

In [20]:
tbmelt.head()

  country  year sexage  cases sex  age
0      AD  1989    m04    NaN   m  0-4
1      AD  1990    m04    NaN   m  0-4
2      AD  1991    m04    NaN   m  0-4
3      AD  1992    m04    NaN   m  0-4
4      AD  1993    m04    NaN   m  0-4

In [21]:
final = tbmelt.dropna(subset=['cases'])

In [27]:
final.sort_values(['country','year','age','sex',])
final = final[['country','year','age','sex','cases']]
final.head()

   country  year  age sex  cases
15      AD  2005  0-4   m    0.0
16      AD  2006  0-4   m    0.0
18      AD  2008  0-4   m    0.0
42      AE  2006  0-4   m    0.0
43      AE  2007  0-4   m    0.0